Revit 2024 API
IFCLegacyStairOrRamp Methods
The IFCLegacyStairOrRamp type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBoundaryLines
 Gets boundary lines.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLandingGeometries
 Gets the geometries of landings.
GetNumberOfRisers
 Gets the number of risers.
GetNumberOfTreads
 Gets the number of treads.
GetRunGeometries
 Gets the geometries of runs.
GetStringerGeometries
 Gets the geometries of stringers.
GetTreadsLength
 Gets the length of treads.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetWalkLines
 Gets walk lines.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace